УТ_для_edt/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеСоСклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВНаличииГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеСоСкладаГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбеспечения</name>
  <enumValues>
    <name>ОтгрузитьОбособленно</name>
  </enumValues>
  <enumValues>
    <name>Отгрузить</name>
  </enumValues>
  <enumValues>
    <name>СоСклада</name>
  </enumValues>
  <enumValues>
    <name>ИзЗаказов</name>
  </enumValues>
  <enumValues>
    <name>Обособленно</name>
  </enumValues>
  <enumValues>
    <name>Требуется</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/КлассификаторТНВЭД/КлассификаторТНВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторТНВЭД</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементОбработан</name>
    <comment>Произведено заполнение единицы измерения при обновлении ИБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СырьевойТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОбязательнаяМаркировка</name>
    <comment>#Б-3788 смарт: Лопато 16.07.2025 //Маркировка радиоэлектронной продукции. Доработка справочника &quot;Коды ТН ВЭД&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЭкспериментальныйРежимМаркировки</name>
    <comment>#Б-3788 смарт: Лопато 16.07.2025 //Маркировка радиоэлектронной продукции. Доработка справочника &quot;Коды ТН ВЭД&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВидМаркировки</name>
    <comment>//++ #Б5134 смарт: Шляпников 18.12.2025 / Маркировка радиоэлектронной продукции. Доработка справочника &quot;Коды ТН ВЭД&quot;. Добавить перечисления Вид маркировки.</comment>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>смартБазоваяСтавка</name>
    <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартПовышенныйТаможенныйСбор</name>
    <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШтрихкода</name>
    <type>
      <types>EnumRef.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>DefinedType.Упаковка</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУказанияСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаЗначенияШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСуммаНормализации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПотребительскихУпаковок</name>
    <comment>Количество потребительских упаковок (при маркировке нефиксированного базового количества)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартМаркировка/Module.bsl
#Область Интерфейс

Функция ПолучитьПризнакИспользованияМаркировкиДляНоменклатуры(Номенклатура, Дата = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "смартОбязательнаяМаркировка,смартДатаНачалаОбязательнойМаркировки,смартПроверкаПроведенаМаркировкаНеТребуется,КодТНВЭД.смартОбязательнаяМаркировка,КодТНВЭД.смартЭкспериментальныйРежимМаркировки");
	Иначе
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("смартОбязательнаяМаркировка", Номенклатура.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("смартДатаНачалаОбязательнойМаркировки", Номенклатура.смартДатаНачалаОбязательнойМаркировки);
		Реквизиты.Вставить("смартПроверкаПроведенаМаркировкаНеТребуется", Номенклатура.смартПроверкаПроведенаМаркировкаНеТребуется);
		Реквизиты.Вставить("КодТНВЭДсмартОбязательнаяМаркировка", Номенклатура.КодТНВЭД.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("КодТНВЭДсмартЭкспериментальныйРежимМаркировки", Номенклатура.КодТНВЭД.смартЭкспериментальныйРежимМаркировки);
		
	КонецЕсли;
	
	Если Реквизиты.смартОбязательнаяМаркировка Тогда
		
		Если ЗначениеЗаполнено(Дата) Тогда
			Возврат Дата >= Реквизиты.смартДатаНачалаОбязательнойМаркировки;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Реквизиты.смартПроверкаПроведенаМаркировкаНеТребуется Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ?(Реквизиты.КодТНВЭДсмартОбязательнаяМаркировка = NULL, ЛОЖЬ, Реквизиты.КодТНВЭДсмартОбязательнаяМаркировка)
			ИЛИ ?(Реквизиты.КодТНВЭДсмартЭкспериментальныйРежимМаркировки = NULL, ЛОЖЬ, Реквизиты.КодТНВЭДсмартЭкспериментальныйРежимМаркировки);
	
КонецФункции

Функция НоменклатураПодлежитОбязательнойМаркировке(Номенклатура, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "смартОбязательнаяМаркировка,смартДатаНачалаОбязательнойМаркировки,смартПроверкаПроведенаМаркировкаНеТребуется,КодТНВЭД.смартОбязательнаяМаркировка,КодТНВЭД.смартЭкспериментальныйРежимМаркировки");
	Иначе
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("смартОбязательнаяМаркировка", Номенклатура.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("смартДатаНачалаОбязательнойМаркировки", Номенклатура.смартДатаНачалаОбязательнойМаркировки);
		Реквизиты.Вставить("смартПроверкаПроведенаМаркировкаНеТребуется", Номенклатура.смартПроверкаПроведенаМаркировкаНеТребуется);
		Реквизиты.Вставить("КодТНВЭДсмартОбязательнаяМаркировка", Номенклатура.КодТНВЭД.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("КодТНВЭДсмартЭкспериментальныйРежимМаркировки", Номенклатура.КодТНВЭД.смартЭкспериментальныйРежимМаркировки);
		
	КонецЕсли;
	
	Если Реквизиты.смартОбязательнаяМаркировка Тогда
		
		Если ЗначениеЗаполнено(Дата) Тогда
			Возврат Дата >= Реквизиты.смартДатаНачалаОбязательнойМаркировки;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Реквизиты.смартПроверкаПроведенаМаркировкаНеТребуется Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ?(Реквизиты.КодТНВЭДсмартОбязательнаяМаркировка = NULL, ЛОЖЬ, Реквизиты.КодТНВЭДсмартОбязательнаяМаркировка);
	
КонецФункции

Функция НоменклатураПодлежитОбязательнойМаркировкеВБудущем(Номенклатура, Дата) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "смартОбязательнаяМаркировка,смартДатаНачалаОбязательнойМаркировки,смартПроверкаПроведенаМаркировкаНеТребуется,КодТНВЭД.смартОбязательнаяМаркировка,КодТНВЭД.смартЭкспериментальныйРежимМаркировки");
	Иначе
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("смартОбязательнаяМаркировка", Номенклатура.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("смартДатаНачалаОбязательнойМаркировки", Номенклатура.смартДатаНачалаОбязательнойМаркировки);
		Реквизиты.Вставить("смартПроверкаПроведенаМаркировкаНеТребуется", Номенклатура.смартПроверкаПроведенаМаркировкаНеТребуется);
		Реквизиты.Вставить("КодТНВЭДсмартОбязательнаяМаркировка", Номенклатура.КодТНВЭД.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("КодТНВЭДсмартЭкспериментальныйРежимМаркировки", Номенклатура.КодТНВЭД.смартЭкспериментальныйРежимМаркировки);
		
	КонецЕсли;
	
	Если Реквизиты.смартОбязательнаяМаркировка И Дата < Реквизиты.смартДатаНачалаОбязательнойМаркировки Тогда
		
		Возврат Реквизиты.смартДатаНачалаОбязательнойМаркировки;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция НоменклатураПодлежитЭксперементальнойМаркировке(Номенклатура, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "смартОбязательнаяМаркировка,смартДатаНачалаОбязательнойМаркировки,смартПроверкаПроведенаМаркировкаНеТребуется,КодТНВЭД.смартОбязательнаяМаркировка,КодТНВЭД.смартЭкспериментальныйРежимМаркировки");
	Иначе
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("смартОбязательнаяМаркировка", Номенклатура.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("смартДатаНачалаОбязательнойМаркировки", Номенклатура.смартДатаНачалаОбязательнойМаркировки);
		Реквизиты.Вставить("смартПроверкаПроведенаМаркировкаНеТребуется", Номенклатура.смартПроверкаПроведенаМаркировкаНеТребуется);
		Реквизиты.Вставить("КодТНВЭДсмартОбязательнаяМаркировка", Номенклатура.КодТНВЭД.смартОбязательнаяМаркировка);
		Реквизиты.Вставить("КодТНВЭДсмартЭкспериментальныйРежимМаркировки", Номенклатура.КодТНВЭД.смартЭкспериментальныйРежимМаркировки);
		
	КонецЕсли;
	
	Если Реквизиты.смартОбязательнаяМаркировка Тогда
		
		Если ЗначениеЗаполнено(Дата) Тогда
			Возврат Дата < Реквизиты.смартДатаНачалаОбязательнойМаркировки;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Реквизиты.смартПроверкаПроведенаМаркировкаНеТребуется Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ?(Реквизиты.КодТНВЭДсмартЭкспериментальныйРежимМаркировки = NULL, ЛОЖЬ, Реквизиты.КодТНВЭДсмартЭкспериментальныйРежимМаркировки);
	
КонецФункции

Функция ПредупреждениеПоДокументуБылоОтправленоРанее(Документ, ИзмененияТабЧасти = Ложь) Экспорт
	
	Если Документ.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Хэш = СформироватьХэшПоДокументу(Документ, ИзмененияТабЧасти);
	
	Если НЕ ИзмененияТабЧасти Тогда
		ИмяСвойства = "УведомлениеОМаркировкеОтправлено";
		ИмяХэш = "МаркировкаХэшСумма";
	Иначе
		ИмяСвойства = "УведомлениеОМаркировкеОтправленоИзменения";
		ИмяХэш = "МаркировкаХэшСуммаИзменения";
	КонецЕсли;
	
	Данные = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(Документ.Ссылка);
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Если Данные.Свойство(ИмяСвойства) И Данные.Свойство(ИмяХэш) И Данные[ИмяХэш] = Хэш Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаписатьИнформациюОбОтправленномПредупрежденииПоДокументу(Документ, ИзмененияТабЧасти = Ложь) Экспорт
	
	Если Документ.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Хэш = СформироватьХэшПоДокументу(Документ, ИзмененияТабЧасти);
	
	Данные = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(Документ.Ссылка);
	Если НЕ ТипЗнч(Данные) = Тип("Структура") Тогда
		Данные = Новый Структура;
	КонецЕсли;
	
	Если НЕ ИзмененияТабЧасти Тогда
		ИмяСвойства = "УведомлениеОМаркировкеОтправлено";
		ИмяХэш = "МаркировкаХэшСумма";
	Иначе
		ИмяСвойства = "УведомлениеОМаркировкеОтправленоИзменения";
		ИмяХэш = "МаркировкаХэшСуммаИзменения";
	КонецЕсли;
	
	Данные.Вставить(ИмяСвойства, Истина);
	Данные.Вставить(ИмяХэш, Хэш);

	смартСерверПривилегированный.ЗаписатьДополнительныеДанныеОбъекта(Документ.Ссылка, Данные);
	
КонецПроцедуры

Функция КонтроллироватьОтгрузкуМаркированнойПродукции(Дата) Экспорт
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("КонтроллироватьОтгрузкуМаркированнойПродукции", Ложь) <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДатаНачалаКонтроляОтгрузкиМаркированнойПродукции", Дата(1, 1, 1)) > Дата Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура МодифицироватьФормуСпискаНоменклатуры(Форма) Экспорт
	
	Если НЕ КонтроллироватьОтгрузкуМаркированнойПродукции(ТекущаяДата()) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтрНайти(Форма.СписокНоменклатура.ТекстЗапроса, "смартИндексКартинкиМаркировки") > 0 Тогда
		
		ТекстЗамены = "СпрНоменклатура.Родитель,";
		ТекстВставки = "	ВЫБОР КОГДА (СпрНоменклатура.КодТНВЭД.смартОбязательнаяМаркировка ИЛИ СпрНоменклатура.смартОбязательнаяМаркировка) И НЕ СпрНоменклатура.смартПроверкаПроведенаМаркировкаНеТребуется ТОГДА 1 КОГДА СпрНоменклатура.КодТНВЭД.смартЭкспериментальныйРежимМаркировки И НЕ СпрНоменклатура.смартПроверкаПроведенаМаркировкаНеТребуется ТОГДА 0 ИНАЧЕ -1 КОНЕЦ КАК смартИндексКартинкиМаркировки,";
		Форма.СписокНоменклатура.ТекстЗапроса = СтрЗаменить(Форма.СписокНоменклатура.ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстЗамены, Символы.ПС, ТекстВставки));
		
		ТекстЗамены = "СправочникНоменклатура.Родитель КАК Родитель,";
		ТекстВставки = "	ВЫБОР КОГДА (СправочникНоменклатура.КодТНВЭД.смартОбязательнаяМаркировка ИЛИ СправочникНоменклатура.смартОбязательнаяМаркировка) И НЕ СправочникНоменклатура.смартПроверкаПроведенаМаркировкаНеТребуется ТОГДА 1 КОГДА СправочникНоменклатура.КодТНВЭД.смартЭкспериментальныйРежимМаркировки И НЕ СправочникНоменклатура.смартПроверкаПроведенаМаркировкаНеТребуется ТОГДА 0 ИНАЧЕ -1 КОНЕЦ КАК смартИндексКартинкиМаркировки,";
		Форма.СписокНоменклатура.ТекстЗапроса = СтрЗаменить(Форма.СписокНоменклатура.ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстЗамены, Символы.ПС, ТекстВставки));
		
	КонецЕсли;
	
	СвойстваКолонки = Новый Структура;
	СвойстваКолонки.Вставить("Вид", ВидПоляФормы.ПолеКартинки);
	СвойстваКолонки.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
    СвойстваКолонки.Вставить("КартинкаЗначений", БиблиотекаКартинок.смартЧестныйЗнакКоллекция);
	СвойстваКолонки.Вставить("КартинкаШапки", БиблиотекаКартинок.смартЧестныйЗнак16);
	СвойстваКолонки.Вставить("РастягиватьПоГоризонтали", Ложь);
	СвойстваКолонки.Вставить("Ширина", 2);
	СвойстваКолонки.Вставить("МаксимальнаяШирина", 2);
	СвойстваКолонки.Вставить("АвтоМаксимальнаяШирина", Ложь);
	Если Форма.Элементы.Найти("смартМаркировкаКартинка") = Неопределено Тогда
		смартФормированиеИнтерфейса.СздПоле(Форма, "смартМаркировкаКартинка", "СписокРасширенныйПоискНоменклатура",, 1, "СписокНоменклатура.смартИндексКартинкиМаркировки", СвойстваКолонки,, "СписокРасширенныйПоискНоменклатураАртикул");
	КонецЕсли;
	Если Форма.Элементы.Найти("смартМаркировкаКартинкаСтд") = Неопределено Тогда
		смартФормированиеИнтерфейса.СздПоле(Форма, "смартМаркировкаКартинкаСтд", "СписокСтандартныйПоискНоменклатура",, 1, "СписокНоменклатура.смартИндексКартинкиМаркировки", СвойстваКолонки,, "СписокСтандартныйПоискНоменклатураАртикул");
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапрещатьПеремещениеМаркированнойПродукции(Дата) Экспорт
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ЗапрещатьПеремещениеМаркированныхТоваров", Ложь) <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДатаНачалаЗапретаПеремещенияМаркированныхТоваров", Дата(1, 1, 1)) > Дата Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьВозможностьПеремещенияТоваров(Документ, ТекстСообщения) Экспорт
	
	Если НЕ ЗапрещатьПеремещениеМаркированнойПродукции(Документ.Дата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	БлокироватьПроведение = Истина;
	СкладыИсключения = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("СкладыСРазрешениемПеремещенияМаркировки").Выгрузить();
	
	//++ #6674  смарт: Тимофеева 24.04.2026 / Маркировка радиоэлектронной продукции. Запрет на перемещение между складами. Дополнение.
	//Если СкладыИсключения.Найти(Документ.СкладОтправитель) <> Неопределено И СкладыИсключения.Найти(Документ.СкладПолучатель) <> Неопределено Тогда
	//	БлокироватьПроведение = Ложь;
	//КонецЕсли;  
	
	НазначенияСкладовИсключения = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("НазначенияСкладовСРазрешениемПеремещенияМаркировки").Выгрузить();
	НазначениеСкладаОтправителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.СкладОтправитель, "смартНазначениеСклада");
	НазначениеСкладаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.СкладПолучатель, "смартНазначениеСклада");
	Если (СкладыИсключения.Найти(Документ.СкладОтправитель) <> Неопределено И СкладыИсключения.Найти(Документ.СкладПолучатель) <> Неопределено) 
		ИЛИ (НазначенияСкладовИсключения.Найти(НазначениеСкладаОтправителя) <> Неопределено И НазначенияСкладовИсключения.Найти(НазначениеСкладаПолучателя) <> Неопределено)
		ИЛИ (СкладыИсключения.Найти(Документ.СкладОтправитель) <> Неопределено И НазначенияСкладовИсключения.Найти(НазначениеСкладаПолучателя) <> Неопределено) 
		ИЛИ (НазначенияСкладовИсключения.Найти(НазначениеСкладаОтправителя) <> Неопределено И СкладыИсключения.Найти(Документ.СкладПолучатель) <> Неопределено)
		Тогда
		БлокироватьПроведение = Ложь;
	КонецЕсли; 
	//-- #6674  смарт: Тимофеева 24.04.2026
	
	ЕстьМаркировка = Ложь;
	
	МассивСтрок = Новый Массив;
	
	Для каждого стрТовары Из Документ.Товары Цикл
		Если НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, Документ.Дата) Тогда
			ЕстьМаркировка = Истина;
			МассивСтрок.Добавить(СтрШаблон("Маркированная номенклатура : %1, строка № %2", стрТовары.Номенклатура, стрТовары.НомерСтроки));
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьМаркировка И БлокироватьПроведение Тогда
		Возврат СтрСоединить(МассивСтрок, Символы.ПС);
	ИначеЕсли НЕ БлокироватьПроведение И ЕстьМаркировка Тогда
		ТекстСообщения = СтрШаблон("Перемещение между складами %1 - %2 разрешено для маркированной продукции: 
								   |%3", Документ.СкладОтправитель, Документ.СкладПолучатель, СтрСоединить(МассивСтрок, Символы.ПС));
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьВТабличнуюЧастьКолонкиМаркировки(Форма, ИмяТаблицыФормы = "Товары", ИмяКолонкиНоменклатуры = "ТоварыНоменклатура", ПутьКДаннымНоменклатуры = "Объект.Товары.Номенклатура", ИмяПоляОбязательнойМаркировки = "смартЧестныйЗнакОМ", ИмяПоляЭкспериментальнойМаркировки = "смартЧестныйЗнакЭР") Экспорт
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Дата) И НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			ДатаПроверки = ТекущаяДата();
		Иначе
			ДатаПроверки = Форма.Объект.Дата;
		КонецЕсли;
	Исключение
		ДатаПроверки = ТекущаяДата();
	КонецПопытки;
	
	//++ #Б6770 смарт: Шляпников 04.05.2026 / Маркировка. Документ Предзаказ поставщику. Добавит пиктограммы ЧЗ.
	//Если НЕ КонтроллироватьОтгрузкуМаркированнойПродукции(ДатаПроверки) Тогда
	//	Возврат;
	//КонецЕсли;
	//-- #Б6770 смарт: Шляпников 04.05.2026
	
	Попытка
		
		ПутьКТаблице = "";
		Массив = СтрРазделить(ПутьКДаннымНоменклатуры, ".", Ложь);
		ИмяПоляНоменклатуры = "";
		Если Массив.Количество() > 1 Тогда
			ИмяПоляНоменклатуры = Массив[Массив.Количество() - 1];
			Массив.Удалить(Массив.Количество() - 1);
			ПутьКТаблице = СтрСоединить(Массив, ".");
		КонецЕсли;
		
		Если ПутьКТаблице = "" Тогда
			Возврат;
		КонецЕсли;
			
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить(ИмяПоляОбязательнойМаркировки, смартФормированиеИнтерфейса.ОписаниеТипаБулево());
		СтруктураРеквизитов.Вставить(ИмяПоляЭкспериментальнойМаркировки, смартФормированиеИнтерфейса.ОписаниеТипаБулево());
		
		смартФормированиеИнтерфейса.СоздатьРеквизитыТаблицы(Форма, ПутьКТаблице, СтруктураРеквизитов);
			
		ЭлементПеред = ИмяКолонкиНоменклатуры;
		РодительНоменклатуры = Форма.Элементы[ИмяКолонкиНоменклатуры].Родитель;
		Пока ТипЗнч(РодительНоменклатуры) = Тип("ГруппаФормы") 
			И (РодительНоменклатуры.Группировка = ГруппировкаКолонок.ВЯчейке ИЛИ РодительНоменклатуры.Группировка = ГруппировкаКолонок.Вертикальная) Цикл
			ЭлементПеред = РодительНоменклатуры;
			РодительНоменклатуры = РодительНоменклатуры.Родитель;
		КонецЦикла;
		
		Группа = смартФормированиеИнтерфейса.СздГруппаКолонокТаблицыФормы(Форма, СтрШаблон("%1Группа", ИмяПоляОбязательнойМаркировки), РодительНоменклатуры, 1,, Ложь, "Честный знак",, ЭлементПеред);
		
		Свойства = Новый Структура;
		Свойства.Вставить("Вид", ВидПоляФормы.ПолеКартинки);
		Свойства.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
		Свойства.Вставить("КартинкаЗначений", БиблиотекаКартинок.смартЧестныйЗнак32);
		Свойства.Вставить("КартинкаШапки", БиблиотекаКартинок.смартЧестныйЗнак16);
		Свойства.Вставить("Ширина", 2);
		Свойства.Вставить("МаксимальнаяШирина", 2);
		Свойства.Вставить("АвтоМаксимальнаяШирина", Ложь);
		Свойства.Вставить("Подсказка", "Товар подлежит обязательной маркировке");
		Свойства.Вставить("РастягиватьПоГоризонтали", Ложь);
		
		смартФормированиеИнтерфейса.СздПоле(Форма, ИмяПоляОбязательнойМаркировки, Группа,, 0, СтрШаблон("%1.%2", ПутьКТаблице, ИмяПоляОбязательнойМаркировки), Свойства);
		
		Свойства.Вставить("КартинкаЗначений", БиблиотекаКартинок.смартЧестныйЗнакЭР32);
		Свойства.Вставить("КартинкаШапки", БиблиотекаКартинок.смартЧестныйЗнакЭР16);
		Свойства.Вставить("Подсказка", "Товар участвует в эксперименте по маркировке");
		
		смартФормированиеИнтерфейса.СздПоле(Форма, ИмяПоляЭкспериментальнойМаркировки, Группа,, 0, СтрШаблон("%1.%2", ПутьКТаблице, ИмяПоляЭкспериментальнойМаркировки), Свойства);
		
		Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
			
			СтруктураКолонок = Новый Структура;
			СтруктураКолонок.Вставить("смартШтрихкодыУпаковокПодобраны", смартФормированиеИнтерфейса.ОписаниеТипаЧисло(2, 0));
			
			смартФормированиеИнтерфейса.СоздатьРеквизитыТаблицы(Форма, "Объект.Товары", СтруктураКолонок);
			
			Свойства.Вставить("КартинкаЗначений", БиблиотекаКартинок.МаркируемаяПродукцияТЧ);
			Свойства.Вставить("КартинкаШапки", БиблиотекаКартинок.МаркируемаяПродукцияШапка);
			Свойства.Вставить("Подсказка", "Штрихкоды подобраны");
			
			смартФормированиеИнтерфейса.СздПоле(Форма, "смартШтрихкодыУпаковокПодобраны", Группа,, 0, "Объект.Товары.смартШтрихкодыУпаковокПодобраны", Свойства);
			
		КонецЕсли;
		
		Выполнить(СтрШаблон("ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Форма.%1, ИмяПоляНоменклатуры, ИмяПоляОбязательнойМаркировки, ИмяПоляЭкспериментальнойМаркировки);", ПутьКТаблице));
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Таблица, ИмяПоляНоменклатура = "Номенклатура", ИмяПоляОбязательнойМаркировки = "смартЧестныйЗнакОМ", ИмяПоляЭкспериментальнойМаркировки = "смартЧестныйЗнакЭР") Экспорт
	
	Попытка
		
		Для каждого стрТовары Из Таблица Цикл
			
			стрТовары[ИмяПоляОбязательнойМаркировки] = НоменклатураПодлежитОбязательнойМаркировке(стрТовары[ИмяПоляНоменклатура]);
			стрТовары[ИмяПоляЭкспериментальнойМаркировки] = НоменклатураПодлежитЭксперементальнойМаркировке(стрТовары[ИмяПоляНоменклатура]);
			
		КонецЦикла;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура смартЗагрузкаДанныхОМаркировкеВКлассификаторТНВЭД() Экспорт
	
	Соединение = Новый HTTPСоединение("www.gs1ru.org",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
    Запрос = Новый HTTPЗапрос("/marking/TNVED/");
	Запрос.Заголовки.Вставить("User-Agent", "1C-Enterprise/8.3");

    Попытка
        Ответ = Соединение.Получить(Запрос);
    Исключение
        Сообщить("Ошибка загрузки страницы: " + ОписаниеОшибки());
        Возврат;
    КонецПопытки;

    Если Не Ответ.КодСостояния = 200 Тогда
        Сообщить("HTTP-ошибка: " + Ответ.КодСостояния);
        Возврат;
    КонецЕсли;

    ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	ПервыйСимвол = СтрНайти(ТелоОтвета, "через какой Excel шаблон.<br>");
	НужныйТекст = Сред(ТелоОтвета, ПервыйСимвол + СтрДлина("через какой Excel шаблон.<br>") + 1);
	ПоследнийСимвол = СтрНайти(НужныйТекст, "</div>") - 1;
	НужныйТекст = Лев(НужныйТекст, ПоследнийСимвол); 
	
	НужныйТекст = СтрЗаменить(НужныйТекст, "<br>", "");
	НужныйТекст = СтрЗаменить(НужныйТекст, "<u>", "");
	НужныйТекст = СтрЗаменить(НужныйТекст, "</u>", "");

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(НужныйТекст);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	Таблица.Колонки.Добавить("Эксперимент", Новый ОписаниеТипов("Булево")); 
	Таблица.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(10)));
	
	Для Нум = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
		
		СтрокаДанных = СокрЛП(ТекстовыйДокумент.ПолучитьСтроку(Нум));
		Если СтрокаДанных = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(СтрокаДанных, "<a href") Тогда
			
			ПервыйСимволНаименования = СтрНайти(СтрокаДанных, ">") + 1;
			НаименованиеРаздела = Сред(СтрокаДанных, ПервыйСимволНаименования);
			НаименованиеРаздела = СтрЗаменить(НаименованиеРаздела, "</a>", "");
			
			Если СтрНайти(НРег(НаименованиеРаздела), "эксперимент") Тогда                
				Эксперимент = Истина;
			Иначе 
				Эксперимент = Ложь;
			КонецЕсли;
			
		Иначе
			
			МассивКодов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДанных, ";", Истина, Истина);			
			
			Для Каждого ЭлементМассива Из МассивКодов Цикл
				
				НоваяСтрокаТаблицы = Таблица.Добавить();
				НоваяСтрокаТаблицы.Наименование = ТРег(НаименованиеРаздела);
				НоваяСтрокаТаблицы.Эксперимент = Эксперимент;
				НоваяСтрокаТаблицы.Код = ЭлементМассива; 
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.Код КАК Код,
	|	ТЗ.Наименование КАК Наименование,
	|	ТЗ.Эксперимент КАК Эксперимент
	|ПОМЕСТИТЬ ВТТаблица
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификаторТНВЭД.Ссылка КАК Ссылка,
	|	КлассификаторТНВЭД.смартОбязательнаяМаркировка КАК смартОбязательнаяМаркировка,
	|	КлассификаторТНВЭД.смартЭкспериментальныйРежимМаркировки КАК смартЭкспериментальныйРежимМаркировки,
	|	КлассификаторТНВЭД.смартВидМаркировки КАК смартВидМаркировки,
	|	ВТТаблица.Код КАК Код,
	|	ВТТаблица.Наименование КАК Наименование,
	|	ВТТаблица.Эксперимент КАК Эксперимент
	|ИЗ
	|	ВТТаблица КАК ВТТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|		ПО ВТТаблица.Код = КлассификаторТНВЭД.Код";
	
	Запрос.УстановитьПараметр("ТЗ", Таблица);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если (Выборка.Эксперимент И НЕ Выборка.смартЭкспериментальныйРежимМаркировки)
			ИЛИ (НЕ Выборка.Эксперимент И НЕ Выборка.смартОбязательнаяМаркировка) Тогда
			
			ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекОбъект.смартЭкспериментальныйРежимМаркировки = Выборка.Эксперимент;
			ТекОбъект.смартОбязательнаяМаркировка = НЕ Выборка.Эксперимент;
			ТекОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьОтметкуОПодобранныхШтрихкодахВДокументе(Форма) Экспорт
	
	Попытка
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Дата) И НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			ДатаПроверки = ТекущаяДата();
		Иначе
			ДатаПроверки = Форма.Объект.Дата;
		КонецЕсли;
	Исключение
		ДатаПроверки = ТекущаяДата();
	КонецПопытки;
	
	Если НЕ КонтроллироватьОтгрузкуМаркированнойПродукции(ДатаПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ТЗШтрихкоды = Форма.Объект.ШтрихкодыУпаковок.Выгрузить();
		
		Для каждого стрТовары Из Форма.Объект.Товары Цикл
			
			Если НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, ДатаПроверки) Тогда
				
				стрТовары.смартШтрихкодыУпаковокПодобраны = 2;
				Счетчик = стрТовары.Количество;
				
				Количество = ТЗШтрихкоды.Количество();
				Для н = 1 По Количество Цикл
					
					ТекСтрока = ТЗШтрихкоды[Количество - н];
					Если ТекСтрока.ШтрихкодУпаковки.Номенклатура = стрТовары.Номенклатура Тогда
						Счетчик = Счетчик - 1;
						ТЗШтрихкоды.Удалить(ТекСтрока);
					КонецЕсли;
					
					Если Счетчик = 0 Тогда
						стрТовары.смартШтрихкодыУпаковокПодобраны = 1;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				стрТовары.смартШтрихкодыУпаковокПодобраны = 0;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапрещатьСборкуРазборкуМаркированнойПродукции(Дата) Экспорт
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ЗапрещатьСборкуРазборкуМаркированныхТоваров", Ложь) <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДатаНачалаЗапретаСборкиРазборкиМаркированныхТоваров", Дата(1, 1, 1)) > Дата Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьВозможностьСборкиРазборки(Документ, ТекстСообщения) Экспорт
	
	Если НЕ ЗапрещатьСборкуРазборкуМаркированнойПродукции(Документ.Дата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕстьМаркировка = Ложь;
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Проведение документа запрещено! В документе содержится маркируемый товар (обязательная или экспериментальная маркировка) - записать / провести документ невозможно.");
	
	Если НоменклатураПодлежитОбязательнойМаркировке(Документ.Номенклатура, Документ.Дата) Тогда
		ЕстьМаркировка = Истина;
		МассивСтрок.Добавить(СтрШаблон("Маркированная номенклатура : %1 в шапке документа", Документ.Номенклатура));
	КонецЕсли;
		
	Для каждого стрТовары Из Документ.Товары Цикл
		Если НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, Документ.Дата) Тогда
			ЕстьМаркировка = Истина;
			МассивСтрок.Добавить(СтрШаблон("Маркированная номенклатура : %1, строка № %2", стрТовары.Номенклатура, стрТовары.НомерСтроки));
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьМаркировка Тогда
		Возврат СтрСоединить(МассивСтрок, Символы.ПС);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

//++ #6676  смарт: Тимофеева 27.04.2026 / Маркировка радиоэлектронной продукции. Запрет проведения документа Заказ на внутреннее потребление.
Функция ЗапрещатьВнутреннееПотреблениеМаркированнойПродукции(Дата) Экспорт
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ЗапрещатьВнутреннееПотреблениеМаркированныхТоваров", Ложь) <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ДатаНачалаЗапретаВнутреннегоПотребленияМаркированныхТоваров", Дата(1, 1, 1)) > Дата Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьВозможностьВнутреннегоПотребления(Документ, ТекстСообщения) Экспорт
	
	Если НЕ ЗапрещатьВнутреннееПотреблениеМаркированнойПродукции(Документ.Дата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕстьМаркировка = Ложь;
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Проведение документа запрещено! В документе содержится маркируемый товар (обязательная или экспериментальная маркировка) - записать / провести документ невозможно.");
	
	Для каждого стрТовары Из Документ.Товары Цикл
		Если НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, Документ.Дата) Тогда
			ЕстьМаркировка = Истина;
			МассивСтрок.Добавить(СтрШаблон("Маркированная номенклатура : %1, строка № %2", стрТовары.Номенклатура, стрТовары.НомерСтроки));
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьМаркировка Тогда
		Возврат СтрСоединить(МассивСтрок, Символы.ПС);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 
//-- #6676  смарт: Тимофеева 27.04.2026

//++ #4602 смарт: Тимофеева 23.04.2026 / Маркировка радиоэлектронной продукции. Системные уведомления пользователей. 
Функция ПолучитьМаркируемыйТоварИзКоллекции(ТаблицаТовары, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.*
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	&ТаблицаТовары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.*
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Количество = ТЗ.Количество();
	
	Для н = 1 По Количество Цикл
		
		ТекСтрока = ТЗ[Количество - н];
		Если НЕ НоменклатураПодлежитОбязательнойМаркировке(ТекСтрока.Номенклатура, Дата) Тогда
			ТЗ.Удалить(ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции 

Функция ПолучитьРеализацииСНеподобраннымиШтрихкодамиУпаковок(ТаблицаТоварыПоРаспоряжениям) Экспорт	
	
	ТаблицаТоваровРеализацииСНеподобраннымиШтрихкодамиУпаковок = ПолучитьТаблицуТоваровРеализацииСНеподобраннымиШтрихкодамиУпаковок(ТаблицаТоварыПоРаспоряжениям);
	ТаблицаРеализаций = ТаблицаТоваровРеализацииСНеподобраннымиШтрихкодамиУпаковок.Скопировать(, "РеализацияТоваровУслуг");
	ТаблицаРеализаций.Свернуть("РеализацияТоваровУслуг");
	
	Возврат ТаблицаРеализаций.ВыгрузитьКолонку("РеализацияТоваровУслуг");
	
КонецФункции 

Функция ПолучитьТаблицуТоваровРеализацииСНеподобраннымиШтрихкодамиУпаковок(ТаблицаТоварыПоРаспоряжениям) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
	|	ТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	ТоварыПоРаспоряжениям.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ТоварыПоРаспоряжениям
	|ИЗ
	|	&ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыПоРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = РеализацияТоваровУслугТовары.ЗаказКлиента)
	|			И (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура)
	|			И (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика = РеализацияТоваровУслугТовары.Характеристика)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК РеализацияТоваровУслуг,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки) КАК Количество
	|ПОМЕСТИТЬ ВТ_ШтрихкодыПоРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ПО (РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыПоРеализации.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
	|	ВТ_ТоварыПоРеализации.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыПоРеализации.Характеристика КАК Характеристика,
	|	ВТ_ТоварыПоРеализации.Количество КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ВТ_ШтрихкодыПоРеализации.Количество, 0) КАК КоличествоПодобрано
	|ИЗ
	|	ВТ_ТоварыПоРеализации КАК ВТ_ТоварыПоРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыПоРеализации КАК ВТ_ШтрихкодыПоРеализации
	|		ПО ВТ_ТоварыПоРеализации.РеализацияТоваровУслуг = ВТ_ШтрихкодыПоРеализации.РеализацияТоваровУслуг
	|			И ВТ_ТоварыПоРеализации.Номенклатура = ВТ_ШтрихкодыПоРеализации.Номенклатура
	|			И ВТ_ТоварыПоРеализации.Характеристика = ВТ_ШтрихкодыПоРеализации.Характеристика
	|ГДЕ
	|	НЕ ВТ_ТоварыПоРеализации.Количество = ЕСТЬNULL(ВТ_ШтрихкодыПоРеализации.Количество, 0)";
	
	Запрос.УстановитьПараметр("ТоварыПоРаспоряжениям", ТаблицаТоварыПоРаспоряжениям);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 
//-- #4602 смарт: Тимофеева 23.04.2026

Функция ПолучитьСообщениеОБудущейМаркировкеНоменклатуры(МассивНоменклатуры, МассивХарактеристик, Дата) Экспорт
	
	МассивНоменклатурыВРаботе = Новый Массив;
	МассивХарактеристикВРаботе = Новый Массив;
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
			МассивНоменклатуры, 
			"смартОбязательнаяМаркировка,смартДатаНачалаОбязательнойМаркировки,Наименование");
	
	Для н = 0 По МассивНоменклатуры.Количество() - 1 Цикл
	
		Если РеквизитыНоменклатуры[МассивНоменклатуры[н]].смартОбязательнаяМаркировка
			И ЗначениеЗаполнено(РеквизитыНоменклатуры[МассивНоменклатуры[н]].смартДатаНачалаОбязательнойМаркировки)
			И РеквизитыНоменклатуры[МассивНоменклатуры[н]].смартДатаНачалаОбязательнойМаркировки > Дата Тогда
			
			МассивНоменклатурыВРаботе.Добавить(МассивНоменклатуры[н]);
			МассивХарактеристикВРаботе.Добавить(МассивХарактеристик[н]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Склад КАК Склад,
		|	Остатки.ВНаличииОстаток - Остатки.ВРезервеСоСкладаОстаток КАК КоличествоВНаличии,
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(
		|			&ДатаОстатков,
		|			Номенклатура В (&Номенклатура)
		|				И Характеристика В (&Характеристика)) КАК Остатки
		|ГДЕ
		|	Остатки.ВНаличииОстаток - Остатки.ВРезервеСоСкладаОстаток > 0";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатурыВРаботе);
	Запрос.УстановитьПараметр("Характеристика", МассивХарактеристикВРаботе);
	Запрос.УстановитьПараметр("ДатаОстатков", Дата);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	МассивСообщений = Новый Массив;
	
	Для н = 0 По МассивНоменклатурыВРаботе.Количество() - 1 Цикл
	
		ДатаНачала = Формат(
					РеквизитыНоменклатуры[МассивНоменклатурыВРаботе[н]].смартДатаНачалаОбязательнойМаркировки, 
					"ДФ=dd.MM.yyyy");
			
		ТекстСообщения = СтрШаблон(
			"В документе содержится маркируемый товар: %1. С %2 начинает действовать обязательная маркировка. Скорректируйте дату на реальную.",
			РеквизитыНоменклатуры[МассивНоменклатурыВРаботе[н]].Наименование,
			ДатаНачала);
			
		МассивСообщений.Добавить(ТекстСообщения);
		
		МассивСообщений.Добавить(ПолучитьСообщениеОБудущейМаркировкеНоменклатурыПоОстаткам(ТаблицаОстатков.НайтиСтроки(Новый Структура("Номенклатура,Характеристика", МассивНоменклатурыВРаботе[н], МассивХарактеристикВРаботе[н]))));
		
	КонецЦикла;
	
	Возврат СтрСоединить(МассивСообщений, Символы.ПС);
	
КонецФункции

Функция ПолучитьСообщениеОБудущейМаркировкеНоменклатурыПоОстаткам(ТаблицаОстатков)
	
	ТекстСообщения = "";
	
	Если ТаблицаОстатков.Количество() > 0 Тогда
		
		ТекстСообщения = ТекстСообщения	+ "Для доступного остатка необходимо заказать коды маркировки.";
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Текущий доступный остаток:";
		
		Для каждого Выборка Из ТаблицаОстатков Цикл
			
			СтрокаСклад = СтрШаблон(
				"%1 %2 - %3",
				Выборка.Склад.Наименование,
				Выборка.Номенклатура.Наименование,
				Выборка.КоличествоВНаличии);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрокаСклад;
			
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Процедура ПроверитьЗаполненностьСерииМаркированныхТоваров(Документ, Отказ) Экспорт
	
	Для каждого стрТовар Из Документ.Товары Цикл
		
		Если смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(стрТовар.Номенклатура, Документ.Дата) Тогда
			
			Если Не ЗначениеЗаполнено(стрТовар.Серия) Тогда
				ТекстСообщения = СтрШаблон(
					"Для маркированного товара '%1' (строка %2) не заполнена серия.",
					стрТовар.Номенклатура,
					стрТовар.НомерСтроки);
				
				ИмяПоля = "Товары[" + (стрТовар.НомерСтроки - 1) + "].Серия";
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					Документ,
					ИмяПоля,
					"",
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОтформатироватьКИЗИВыкинутьКриптохвост(Знач ПолныйКод) Экспорт
	
	ПолныйКод = СтрЗаменить(ПолныйКод, "○", Символ(29));
	
	ШК = ШтрихкодированиеИС.КодGS1ДляКомпонентыПечати(ПолныйКод, 2);
	
	// Сначала ищем скобочный вариант "(91)"/"(92)" — результат работы парсера
	Позиция = Мин(СтрНайти(ШК, "(91)"), СтрНайти(ШК, "(92)"));
	
	// Если не нашли — ищем "91"/"92" после позиции 38 (конец блока GTIN+Serial)
	Если Позиция = 0 И СтрДлина(ШК) >= 39 Тогда
		Остаток = Сред(ШК, 39);
		ПозицияВХвосте = Мин(СтрНайти(Остаток, "91"), СтрНайти(Остаток, "92"));
		Если ПозицияВХвосте > 0 Тогда
			Позиция = 38 + ПозицияВХвосте;
		КонецЕсли;
	КонецЕсли;
	
	Если Позиция > 0 Тогда
		ШК = Лев(ШК, Позиция - 2);
	КонецЕсли;
	
	Возврат ШК;
	
КонецФункции

#КонецОбласти

#Область Служебные

Функция СформироватьХэшПоДокументу(Документ, ИзмененияТабЧасти = Ложь)
	
	Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ТЗНоменклатура = Документ.Товары.Выгрузить(Новый Структура("Отменено", Ложь));
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		ТЗНоменклатура = Документ.ОтгружаемыеТовары.Выгрузить();
	Иначе
		ТЗНоменклатура = Документ.Товары.Выгрузить();
	КонецЕсли;
	
	ТЗНоменклатура.Колонки.Добавить("Наименование");
	ТЗНоменклатура.Колонки.Добавить("Учитывать");
	
	МассивСтрок = Новый Массив;
	
	Для каждого стрНоменклатура Из ТЗНоменклатура Цикл
		
		стрНоменклатура.Наименование = стрНоменклатура.Номенклатура.Наименование;
		
		Если НЕ ИзмененияТабЧасти Тогда
			стрНоменклатура.Учитывать = НоменклатураПодлежитОбязательнойМаркировке(стрНоменклатура.Номенклатура);
		Иначе
			стрНоменклатура.Учитывать = НоменклатураПодлежитЭксперементальнойМаркировке(стрНоменклатура.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗНоменклатура.Сортировать("Наименование");
	
	Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		МассивСтрок.Добавить(СтрШаблон("ОтгруженоФИН:%1", Документ.СогласованоБух));
	КонецЕсли;
	
	Для каждого стрНоменклатура Из ТЗНоменклатура Цикл
		
		Если НЕ стрНоменклатура.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок.Добавить(стрНоменклатура.Наименование);
		
		Если ИзмененияТабЧасти Тогда
			
			МассивСтрок.Добавить(стрНоменклатура.Количество);
			
		КонецЕсли;
		
		Если ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			МассивСтрок.Добавить(СокрЛП(?(стрНоменклатура.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить ИЛИ стрНоменклатура.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно, "Отгрузить", "")));
		КонецЕсли;
		
	КонецЦикла;
	
	CRC32 = Новый ХешированиеДанных(ХешФункция.CRC32);
	CRC32.Добавить(СтрСоединить(МассивСтрок, ";"));
	
	Хэш = СтрЗаменить(Строка(CRC32.ХешСумма), Символы.НПП, "");
	
	Возврат Хэш;
	
КонецФункции

Функция НайтиКИЗПоШК(ЗНАЧ Штрихкод) Экспорт
	
	Штрихкод = ОтформатироватьКИЗИВыкинутьКриптохвост(Штрихкод);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
